In [1]:
import pandas as pd
import seaborn as sns

In [4]:
a=sns.load_dataset('titanic')

In [6]:
b=a[['survived','pclass','age','parch']]
c=b.fillna(b.mean())
c.head()

   survived  pclass   age  parch
0         0       3  22.0      0
1         1       1  38.0      0
2         1       3  26.0      0
3         1       1  35.0      0
4         0       3  35.0      0

In [7]:
x=c.drop('survived',axis=1)
y=c['survived']

In [8]:
from sklearn.model_selection import train_test_split

In [9]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25)
print('X_train',x_train.shape)
print('X_test',x_test.shape)
print('Y_train',y_train.shape)
print('Y_test',y_test.shape)

X_train (668, 3)
X_test (223, 3)
Y_train (668,)
Y_test (223,)

In [10]:
x_train

     pclass        age  parch
471       3  38.000000      0
764       3  16.000000      0
105       3  28.000000      0
242       2  29.000000      0
474       3  22.000000      0
..      ...        ...    ...
36        3  29.699118      0
862       1  48.000000      0
589       3  29.699118      0
95        3  29.699118      0
805       3  31.000000      0

[668 rows x 3 columns]